import os

x = '''100784801 经典大模型公开课2024
100785001 中国人工智能成熟度模型报告
100017301 数据结构与算法之美
100020801 MySQL实战45讲
100002201 左耳听风
100006601 从0开始学架构
100007101 趣谈网络协议
100006701 Java核心技术面试精讲
100039001 设计模式之美
100021701 数据分析实战45讲
100017001 极客视点
100015201 深入剖析Kubernetes
100026901 Python核心技术与实战
100023201 重学前端
100023501 玩转Spring全家桶
100020901 Linux性能优化实战
100010301 深入拆解Java虚拟机
100024701 趣谈Linux操作系统
100025201 许式伟的架构课
100021201 程序员的数学基础课
100006201 技术领导力实战笔记
100056701 Redis核心技术与实战
100013101 Go语言核心36讲
100019701 算法面试通关40讲
100029501 SQL必知必会
100023901 Java并发编程实战
100009601 软件测试52讲
100020201 从0开始学大数据
100026001 深入浅出计算机组成原理
100030501 Elasticsearch核心技术与实战
100078401 操作系统实战45讲
100014301 技术管理实战36讲
100014401 从0开始学微服务
100029001 透视HTTP协议
100020301 Nginx核心知识150讲
100024601 Vue开发实战
100310001 零基础学Python（2023版）
100021601 玩转Git三剑客
100003101 人工智能基础课
100028001 Java性能调优实战
100042601 小马哥讲Spring核心编程思想
100033601 浏览器工作原理与实践
100064201 周志明的软件架构课
100017501 如何设计一个秒杀系统
100037301 DDD实战课
100038501 雷蓓蓓的项目管理实战课
100022301 10x程序员工作法
100047701 Java业务开发常见错误100例
100029201 Kafka核心技术与实战
100021101 Android开发高手课
100032301 消息队列高手课
100784801 经典大模型公开课2024
100785001 中国人工智能成熟度模型报告
100017301 数据结构与算法之美
100020801 MySQL实战45讲
100002201 左耳听风
100006601 从0开始学架构
100007101 趣谈网络协议
100006701 Java核心技术面试精讲
100039001 设计模式之美
100021701 数据分析实战45讲
100017001 极客视点
100015201 深入剖析Kubernetes
100026901 Python核心技术与实战
100023201 重学前端
100023501 玩转Spring全家桶
100020901 Linux性能优化实战
100010301 深入拆解Java虚拟机
100024701 趣谈Linux操作系统
100025201 许式伟的架构课
100021201 程序员的数学基础课
100006201 技术领导力实战笔记
100056701 Redis核心技术与实战
100013101 Go语言核心36讲
100019701 算法面试通关40讲
100029501 SQL必知必会
100023901 Java并发编程实战
100009601 软件测试52讲
100020201 从0开始学大数据
100026001 深入浅出计算机组成原理
100030501 Elasticsearch核心技术与实战
100078401 操作系统实战45讲
100014301 技术管理实战36讲
100014401 从0开始学微服务
100029001 透视HTTP协议
100020301 Nginx核心知识150讲
100024601 Vue开发实战
100310001 零基础学Python（2023版）
100021601 玩转Git三剑客
100003101 人工智能基础课
100028001 Java性能调优实战
100042601 小马哥讲Spring核心编程思想
100033601 浏览器工作原理与实践
100064201 周志明的软件架构课
100017501 如何设计一个秒杀系统
100037301 DDD实战课
100038501 雷蓓蓓的项目管理实战课
100022301 10x程序员工作法
100047701 Java业务开发常见错误100例
100029201 Kafka核心技术与实战
100021101 Android开发高手课
100032301 消息队列高手课
100035801 高并发系统设计40问
100002401 朱赟的技术管理课
100024001 Go语言从入门到实战
100003901 微服务架构核心20讲
100007001 微服务架构实战160讲
100029601 Linux实战技能100讲
100027801 零基础学Java
100034101 编译原理之美
100042501 性能测试实战30讲
100023701 软件工程之美
100032701 网络编程实战
100046801 后端存储实战课
100023401 面试现场
100064501 大厂晋升指南
100005101 推荐系统三十六式
100026801 Web协议详解与抓包实战
100024501 iOS开发高手课
100006501 硅谷产品实战36讲
100031001 Flutter核心技术与实战
100036501 说透中台
100079601 Go语言项目开发实战
100025301 大规模数据处理实战
100057601 常用算法25讲
100005701 深入浅出区块链
100046201 RPC实战与核心原理
100009701 持续交付36讲
100036401 分布式技术原理与算法解析
100012001 邱岳的产品实战
100027701 深入拆解Tomcat&Jetty 
100094401 玩转Vue3全家桶
100084801 数据分析思维课
100019601 代码精进之路
100003401 赵成的运维体系管理课
100040201 后端技术面试38讲
100036601 DevOps实战笔记
100036001 Node.js开发实战
100099801 郭东白的架构课
100007201 从0开始学游戏开发
100001901 技术与商业案例解读
100051201 系统性能调优必知必会
100008701 机器学习40讲
100051801 罗剑锋的C++实战笔记
100009301 React实战进阶45讲
100041701 安全攻防技能30讲
100541001 AI大模型之美
100040501 现代C++编程实战
100032201 TypeScript开发实战
100034501 研发效率破局之道
100002601 邱岳的产品手记
100060801 深度学习推荐系统实战
100012101 程序员进阶攻略
100002101 AI技术内参
100024801 池建强的公开课
100036701 Netty源码剖析与实战
100039701 JavaScript核心原理解析
100031801 从0打造音视频直播系统
100035501 全栈工程师修炼指南
100051901 互联网人的英语私教课
100049101 数据中台实战课
100045801 接口测试入门课
100023001 TensorFlow快速入门与实战
100081501 如何成为学习高手
100053801 跟月影学可视化
100057401 分布式数据库30讲
100044301 说透敏捷
100052401 微信小程序全栈开发实战
100069901 etcd实战课
100541101 ChatGPT从0到1
100031401 Spring Boot与Kubernetes云原生微服务实践 
100028901 玩转webpack
100048001 图解GoogleV8
100052801 编译原理实战课
100061801 Go并发编程实战课
100082101 如何落地业务建模
100055001 Web安全攻防实战
100041101 性能工程高手课
100063801 容器实战高手课
100061501 漫谈新基建
100053301 正则表达式入门课
100025001 从0开始做增长
100066601 成为AI产品经理
100062901 乔新亮的CTO成长复盘
100046901 深入浅出云计算
100034901 即时消息技术剖析与实战
100038001 移动端自动化测试实战
100025901 从0开发一款iOS App
100085301 陈天·Rust编程第一课
100058001 Linux内核技术实战课
100105701 李智慧·高并发架构实战课
100100901 业务开发算法50讲
100046101 分布式协议与算法实战
100104301 网络排查案例课
100009801 快速上手Kotlin开发
100090601 手把手带你写一个Web框架
100061901 Django快速开发实战
100043001 摄影入门课
100071001 Python自动化办公实战课
100069501 Go语言编程模式实战
100093501 TonyBai·Go语言第一课
100055801 Vim实用技巧必知必会
100048401 检索技术核心20讲
100104701 深入浅出分布式技术原理
100058401 技术管理案例课
100100701 深入C语言和程序运行原理
100093001 全链路压测实战30讲
100044201 Electron开发实战
100028301 OpenResty从入门到实战
100311801 手把手教你落地DDD
100094901 编程高手必学的内存知识
100034001 Swift核心技术与实战
100020001 白话法律42讲
100114501 Kubernetes入门实战课
100060101 一个草根创业者的40岁人生复盘
100068401 代码之丑
100067701 分布式金融架构课
100052601 软件设计之美
100117801 计算机基础实战课
100044601 .NET Core开发实战
100085501 零基础实战机器学习
100114001 中间件核心技术与实战
100079101 性能优化高手课
100065801 十年架构感悟
100540901 GitHub Copilot 实践课
100043901 人人都能学会的编程入门课
100090001 零基础入门Spark
100040001 MongoDB高手课
100050101 Kafka核心源码解读
100074001 高楼的性能工程实战课
100083301 程序员的个人财富课
100037701 苏杰的产品创新课
100085101 程序员的测试课
100046301 架构实战案例解析
100310101 Linux0.11源码趣读
100108401 说透低代码
100034201 ZooKeeper实战与源码剖析
100055601 Selenium自动化测试实战
100110101 ReactNative新架构实战课
100030701 黄勇的OKR实战笔记
100109401 徐昊·TDD项目实战70讲
100073201 MySQL必知必会
100084301 Redis源码剖析与实战
100050701 视觉笔记入门课
100063601 物联网开发实战
100082001 池建强谈个人成长
100059201 用户体验设计实战课
100541201 ChatGPT和预训练模型实战课
100077001 Spring编程常见错误50例
100109201 自动化测试高手课
100070901 跟着高手学复盘
100050201 Serverless入门课
100053901 OAuth2.0实战课
100097301 深入剖析Java新特性
100119601 现代React Web开发实战
100065901 管理者一定会遇到的那些事
100101301 SpringCloud微服务项目实战
100058801 Flink核心技术与实战
100124001 Go进阶 · 分布式爬虫实战
100046401 NLP实战高手课
100120501 技术领导力实战笔记 2022
100122101 JavaScript进阶实战课
100101501 Web漏洞挖掘实战
100064801 实用密码学
100095401 超级访谈：对话张雪峰
100091101 大数据经典论文解读
100067401 云原生时代的Java
100048201 SRE实战手册
100062001 人人都用得上的写作课
100541301 Stable Diffusion：零基础学会AI绘画
100091501 手把手带你搭建秒杀系统
100070001 手把手教你玩音乐
100117601 快手 · 移动端音视频开发实战
100073301 流程型组织15讲
100309001 高并发系统实战课
100060601 张汉东的Rust实战课
100119701 Serverless进阶实战课
100080001 技术领导者如何提高心力？
100049401 Service Mesh实战
100053601 分布式系统案例课
100076501 说透数字化转型
100077201 李沐的深度学习课
100069101 体验设计案例课
100069401 从中台技术谈架构师的独立思考能力
100052201 职场求生攻略
100066301 小马哥讲Spring AOP编程思想
100062401 手机摄影
100093301 PyTorch深度学习实战
100079901 ReactHooks核心原理与实战
100104501 eBPF核心技术与实战
100059901 WebAssembly入门课
100122701 超级访谈：对话毕玄
100617601 LangChain实战课
100550701 零基础GPT应用入门课
100102001 中国卓越技术团队访谈录
100065501 A-B测试从0到1
100079201 说透芯片
100522501 运维监控系统实战笔记
100060501 动态规划面试宝典
100089601 TiDB 极简入门
100056401 重学线性代数
100551601 后端工程师的高阶面经
100073401 Spark性能调优实战
100070801 恋爱必修课
100613101 AI大模型系统实战
100031101 编辑训练营
100069301 搭建可靠性系统工程实践
100061401 爱上跑步
100117701 商业思维案例笔记
100075401 技术面试官识人手册
100113201 人人都用得上的数字化思维课
100637501 程序员职业规划手册
100098901 攻克视频技术
100085201 手把手带你写一门编程语言
100542901 李三红 · 搞定Java开发基础
100618301 超级访谈：对话道哥
100059801 垂直领域的空间与机会
100053201 TensorFlow 2项目进阶实战
100119501 Web 3.0入局攻略
100311101 Vue 3 企业级项目实战课
100064701 手淘端上AI大规模应用与实践
100123701 超级访谈：对话玉伯
100084201 说透区块链
100115201 大厂设计进阶实战课
100555001 AI绘画核心技术与实战
100072001 基于人因的用户体验设计课
100103401 朱涛·Kotlin编程第一课
100072201 打造爆款短视频
100312001 云原生架构与GitOps实战
100057701 ToB市场品牌实战课
100082501 讲好故事
100056201 如何看懂一幅画
100536701 手把手带你写一个MiniSpring
100552001 深入拆解消息队列47讲
100626901 Rust语言从入门到实战
100109601 超级访谈：对话汤峥嵘
100546401 林清山 · 深度剖析RocketMQ5.0
100057801 怎么理解Serverless？
100112401 说透元宇宙
100111101 遗留系统现代化实战
100078501 容量保障核心技术与实战
100098801 搞定音频技术
100065601 如何拥有一支适配的算法团队
100310901 工行业务架构实践
100121701 深入浅出可观测性
100104601 反爬虫兵法演绎20讲
100107801 大厂广告产品心法
100312101 Dubbo源码剖析与实战
100625601 AI大模型企业应用实战
100117501 快手 · 音视频技术入门课
100076701 爆款文案修炼手册
100117302 Excel-PowerBI 高级数据分析
100116801 行知数字中国
100546501 Python实战 · 从0到1搭建直播视频平台
100755401 徐昊 · AI时代的软件工程
100523801 现代C++20实战高手课
100115401 OceanBase 基础课
100632701 专家齐聚 · 直播回放精选
100542801 手把手带你搭建推荐系统
100102601 去无方向的信
100613601 云时代的JVM原理与实战
100080901 说透5G
100112001 林外 · 专利写作第一课
100524201 快速上手C++数据结构与算法
100770601 AI大模型实战高手课
100633001 AI应用实战课
100548101 碳中和极简入门课
100546701 王远 · PolarDB高手课
100525001 大型Android系统重构实战
100636901 亚马逊 CTO 20 年架构经验之道
100102301 C 位面对面
100612401 Java复杂应用2h极速开发实战
100081901 如何读懂一首诗
100636608 算法（第4版）
100755801 工程师个人发展指南
100122501 云计算必修小课
100754901 Sora技术报告深度解读
100757501 Sora背后的视频生成技术
100547601  B端体验设计入门课
100636401 手把手带你写一个MiniTomcat
100548001 B端产品经理入门课
100085801 HarmonyOS快速入门与实战
100636604 Rust程序设计（第2版）
100764201 大模型应用开发实战
100758001 云原生基础架构实战课
100085401 如何讲好一堂课
100670901 给程序员的写作课
100636606 学透Spring：从入门到项目实战
100775901 AI Agent智能体实战课
100759401 前端全链路优化实战课
100616701 PPT设计进阶 · 从基础操作到高级创意
100671401 行动者内刊
100761401 手写Python虚拟机
100772701 分布式数据库从入门到实战
100610901 结构沟通力
100781001 SRE实践：服务可靠性案例课
100760301 Coze：零基础开发对话机器人
100636612 分布式架构原理与实践
100761001 重学TypeScript
100636611 跟阿铭学Linux
100636610 黑客与画家
100769301 AI数据分析课
100636601 ChatGPT：人类新纪元 
100636605 Python工匠：案例、技巧与工程实践
100767801 人人都是prompt工程师
100757801 Midjourney入门实践课
100780501 零基础拿下云原生CKA认证
100636602 这就是ChatGPT
100636607 详解HTTP：协议基础与Go语言实现
100770701 书生 · 浦语大模型实战课
100636603 Vue.js设计与实现
100610601 结构思考力 · 透过结构看表达
100636609 软件设计：从专业到卓越
100126601 PolarDB for PostgreSQL 开源人才培养课程
100768201 AI Excel从入门到实战
100618201 QCon北京2023·09
100083601 GMTC北京2021
100768101 大模型微调实践课
100637901 互联网人的数字化企业生存指南
100610301 结构思考力 · 透过结构看思考
100641101 Havenask入门基础课
100637601 了不起的极客
100611001 结构写作力
100769401 Stable Diffusion实战课​
100781201 仓颉编程语言入门课
100078701 Archsummit上海2021
100638001 新知实验室
100126501 PolarDB-X 开源人才培养课程
100610501 结构学习力
100767501 AI绘画创作入门课
100768001 AI原生应用入门课
100759901 QCon北京2024
100641001 QCon上海2023
100768401 AI智能办公实战课 
100779901 从0到1布局AIGC
100101601 GMTC深圳2021
100099301 ArchSummit深圳2021
100610701 结构思考力 · 透过结构看问题解决
100768301 AI音视频创作入门课
100096301 QCon上海2021
100769901 AI PPT创作实战课
100551201 QCon广州2023
100610401 结构执行力
100611101 结构会议力
100117329 Excel数据可视化实战
100525201 QCon北京2023·02
100769201 玩转AI创意写作
100547101 ArchSummit上海2023
100779801 AIGC如何加速企业数智化进程
100121101 ArchSummit北京2022
100123501 ArchSummit杭州2022
100761601 QCon 北京 2024 · 大模型篇
100118801 ArchSummit深圳2022
100525301 GMTC北京2023
100611401 ArchSummit深圳2023
100542601 ArchSummit北京2023
100311601 QCon上海2022
100120201 QCon广州2022
100635401 FCon上海2023
100100801 AICon北京2021
100117328 Excel商业分析实战
100081201 QCon北京2021
100121001 PCon北京2022
100618601 QCon北京2023·09深度培训
100613001 ArchSummit深圳2023深度培训
100008801 零基础学Python（2018版）'''


def get_id(cid):
    import requests

    cookies = {
        'LF_ID': 'c8df441-66d3506-9dd8cf4-6246568',
        'GCID': '5907afa-19591d5-a0f2ce2-8a12c7e',
        'GRID': '5907afa-19591d5-a0f2ce2-8a12c7e',
        '_tea_utm_cache_20000743': '{%22utm_source%22:%22geektime_search%22%2C%22utm_medium%22:%22geektime_search%22%2C%22utm_campaign%22:%22geektime_search%22%2C%22utm_term%22:%22geektime_search%22%2C%22utm_content%22:%22geektime_search%22}',
        'gksskpitn': '50cf4fac-0867-4752-93cc-4c17af69137a',
        'gk_process_ev': '{%22count%22:1%2C%22utime%22:1722580095080%2C%22referrer%22:%22https://c.geekbang.org/?cid=6597533689488%22%2C%22target%22:%22page_geektime_login%22}',
        '__tea_cache_tokens_20000743': '{%22web_id%22:%227397357332226915083%22%2C%22user_unique_id%22:%227397357332226915083%22%2C%22timestamp%22:1722581440583%2C%22_type_%22:%22default%22}',
        'SERVERID': '1fa1f330efedec1559b3abbcb6e30f50|1722581440|1722578823',
    }

    headers = {
        'Accept': 'application/json, text/plain, */*',
        'Accept-Language': 'zh-CN,zh;q=0.9,en;q=0.8,en-GB;q=0.7,en-US;q=0.6',
        'Cache-Control': 'no-cache',
        'Connection': 'keep-alive',
        'Content-Type': 'application/json',
        'Origin': 'https://time.geekbang.org',
        'Pragma': 'no-cache',
        'Referer': 'https://time.geekbang.org/column/intro/100064501?tab=catalog',
        'Sec-Fetch-Dest': 'empty',
        'Sec-Fetch-Mode': 'cors',
        'Sec-Fetch-Site': 'same-origin',
        'User-Agent': 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/127.0.0.0 Safari/537.36 Edg/127.0.0.0',
        'X-GEEK-REQ-ID': 'a1e5e1a05b924b0da87d1ef41e291e33@1@web',
        'sec-ch-ua': '"Not)A;Brand";v="99", "Microsoft Edge";v="127", "Chromium";v="127"',
        'sec-ch-ua-mobile': '?0',
        'sec-ch-ua-platform': '"macOS"',
    }

    json_data = {
        'cid': cid,
        'size': 500,
        'prev': 0,
        'order': 'earliest',
        'sample': False,
    }

    response = requests.post('https://time.geekbang.org/serv/v1/column/articles', cookies=cookies, headers=headers,
                             json=json_data)
    return response.json()['data']['list']


def generate_index_html(products):
    # 获取当前目录
    current_dir = os.getcwd()

    # 获取当前目录下的所有文件夹
    folders = [f for f in os.listdir(current_dir) if os.path.isdir(os.path.join(current_dir, f))]

    # 生成 HTML 内容
    html_content = "<!DOCTYPE html>\n<html>\n<head>\n<title>Index of Folders</title>\n</head>\n<body>\n"
    html_content += "<h1>Index of Folders</h1>\n"
    html_content += "<ul>\n"

    for folder in folders:
        pid = None
        if folder in products:
            pid = products[folder]
        print(pid)
        folder_path = os.path.join(current_dir, folder)
        # 创建每个文件夹的链接
        html_content += f"<li><a href='./geek/{folder}' target='_blank'>{folder}</a></li>\n"
        folder_path = os.path.join(current_dir, folder)
        # 获取文件夹中的所有文件
        files = [f for f in os.listdir(folder_path) if os.path.isfile(os.path.join(folder_path, f))]
        # 生成 HTML 内容
        file_content = "<!DOCTYPE html>\n<html>\n<head>\n<title>Index of Folders</title>\n</head>\n<body>\n"
        file_content += "<h1>" + folder + "</h1>\n"
        file_content += "<ul>\n"
        articles = []
        if pid is not None:
            articles = get_id(pid)

        for file in sorted(files):
            # 添加评论
            for article in articles:
                a_title = file.split("-")[-1].replace(".html", "")
                b_title = article['article_title'].split("|")[-1].strip()
                if a_title == b_title:
                    mid = article['id']
                    url = 'https://time.geekbang.org/comment/nice/' + str(mid)
                    comment = "<div><p>评论</p><iframe width='100%'  frameborder=0 height=900px src='" + url + "' > </iframe></div>"
                    full_path = folder_path + "/" + file
                    with open(full_path, "a") as f:
                        f.write(comment)
            if file == 'index.html':
                continue
            file_content += f"<li><a href='./{folder}/{file} target='_blank'>{file}</a></li>\n"
        file_content += "</ul>\n"
        file_content += "</body>\n</html>"

        with open(folder_path + "/index.html", "w") as f:
            f.write(file_content)
    html_content += "</ul>\n</body>\n</html>"

    with open("index.html", "w") as f:
        f.write(html_content)


products = {}
if __name__ == "__main__":
    z = x.split("\n")
    for y in z:
        xx = y.split(" ")
        products[xx[1]] = xx[0]
    generate_index_html(products)
